TidyShell/README.org
#+TITLE: TidyShell
#+AUTHOR: Lucius Hu
** Overview
   Currently, the shell default shell startup files for ~sh~ (Bourne shell, aliased to ~bash~ and thus would be omitted in the following discussion), ~bash~ (Bash), and ~zsh~ (Z Shell) are rather messy in the sense that:

- The environment variables are different for ~bash~ and ~zsh~.
- Some functionalities are not available for ~zsh~ while it's feasible to achieve them in ~zsh~.
- Startup files are sourcing each other, and in some cases the same startup files would be sourced for multiple times.
- ~zsh~ has an entirely different set of startup files as oppose to ~sh~ and ~bash~, but actually most statement in the startup files are compatible to all of the three shells. This may result in inconsistency when future a future update changed startup files for one ~bash~, while such change is not incorporated into ~zsh~, or vice versa.
- The default global startup files are stored in =/usr/share/defaults/etc/=, and an average user may not be aware of them, as many distributions have the system-wide default startup files stored in =/etc=.

** Loading process of startup files
   A summary of how the startup files are processed on Clear Linux (Version 29480) is given below:

*** Login shell:
    Depending on whether the Linux OS boots into text mode or graphical mode, the concept of login shell would be different.

**** Text Mode
     If the user is first presented with a login prompt, and after he successfully log in to a user account the shell prompt appears, then it's *text mode*.

     The shell he is presented to is the *login shell*, which could be changed via ~chsh~ or ~lchsh~. And any sub-process of login shell would inherit the environment variables of the login shell. In particular, if the user invoked another shell either by directly executing a shell program, by using commands such as ~su~, ~sudo~, or by executing a shell script, the invoked shell would inherit the environment variables of the login shell. Thus correctly setting environment variables for the login shell would ensure that they would also be set for any shell invoked after login, while the user is still able to override those environment variables directly or startup files of (interactive) shells.

***** ~bash~
      The ~bash~ login shell first looks for the global profile at =/usr/share/defaults/etc/profile=. Next it tries to locate a per-user profile at =~/.bash_profile=, =~/.bash_login=, and =~/.profile=, where the first one found, in that order, is sourced. By default, only =~/.profile= exists.

      In addition, when a ~bash~ login shell exits, it will source per-user logout script at =~/.bash_logout=, which is not created by default.

***** ~zsh~
      A ~zsh~ login shell will source three types of startup files, i.e. =zshenv=, =zprofile=, and =zlogin=, in that order. For each of the five types, ~zsh~ would look for a global configuration in =/usr/share/defaults/etc/<TYPE>=, and then the user's configuration in =~/.<TYPE>=.

      Similar to ~bash~, when a ~zsh~ process exits, it will source a logout script, =~/.zlogout=.

      Currently, the default global =env=, =zshrc=, and =zlogin= are created, but no local startup file is created.

**** Graphical Mode
     If the user has a graphical display manager, such as =gdm=, installed and enabled, the user would be presented with a graphical user interface where he can choose an desktop environment for the session, and finish the authentication process to log in to a user account. This is called =Graphical Mode=.

     Unlike the text mode, neither ~bash~ nor ~zsh~ is the actual login shell. So the loading sequence of startup files described above might not be valid. Take =gdm= as an example, it is ~/usr/libexec/gdm-x-session~ that acts as a login shell, in the sense that every process started after login is a sub-process of it. What startup files the graphical session will source is complicated, and it varies by both the choice of display manager, and the distribution.

***** =gdm=
      In the case of =gdm=, =/usr/share/gdm/Xsession= defines that ~gdm-x-session~ should source the followings files:
- =/etc/profile=, which is system-wide profile in many /other distribution/, but a /admin override profile/ in Clear Linux.
- =/usr/share/defaults/etc/profile=, the default system-wide profile in Clear Linux (A patch has been submitted which suggest to source this file first)
- =~/.profile=, the per-user profile
- =/etc/xprofile=, system-wide X specific setups
- =~/.xprofile=, per-user X specific setups

      By default, only =/usr/share/defaults/etc/profile= and =~/.profile= exits, therefore the the startup process is the same as the default bahaviour of a ~bash~ login shell.

***** =lightdm=
      =/usr/share/lightdm/lightdm-session= (?) defines the same sequence of startup files, except that it doesn't include =/usr/share/defaults/etc/profile=. (I've sent a patch to the dev team already.)

***** =sddm=
      =/usr/share/sddm/Xsession= (?) and =/usr/share/sddm/wayland-session= (?) reads startup files according to the =$SHELL= environment variable. For ~bash~, ~fish~, and all other shell programs except ~zsh~, it reads the same sequence of files as =gdm=. For ~zsh~, it

