TidyShell/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-28 Tue 02:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TidyShell</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Lucius Hu" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/><link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/></head>
<body>
<div id="content">
<h1 class="title">TidyShell</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf0de18b">1. Overview</a></li>
<li><a href="#orgcdf9631">2. Loading process of startup files</a>
<ul>
<li><a href="#org66ccf21">2.1. Login shell:</a>
<ul>
<li><a href="#org1a71cac">2.1.1. Text Mode</a></li>
<li><a href="#orgd05ac9f">2.1.2. Graphical Mode</a></li>
</ul>
</li>
<li><a href="#orgcabf737">2.2. Interactive Shell</a>
<ul>
<li><a href="#orgc12183b">2.2.1. <code>bash</code></a></li>
<li><a href="#orgc229850">2.2.2. <code>zsh</code></a></li>
</ul>
</li>
<li><a href="#org33eb6b3">2.3. Non-interactive Shell</a>
<ul>
<li><a href="#orgf560267">2.3.1. <code>bash</code></a></li>
<li><a href="#org6d854d2">2.3.2. <code>zsh</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge05ed78">3. Current default startup files</a>
<ul>
<li>
<ul>
<li><a href="#orgccb0ffa">3.0.1. <code>/usr/share/defaults/etc/profile</code></a></li>
<li><a href="#org175894b">3.0.2. <code>~/.profile</code></a></li>
<li><a href="#org7e5713f">3.0.3. <code>/usr/share/defaults/etc/bash.bashrc</code></a></li>
<li><a href="#org484cef5">3.0.4. <code>~/.bashrc</code></a></li>
<li><a href="#orgf1772ad">3.0.5. <code>/usr/share/defaults/etc/zshenv</code></a></li>
<li><a href="#org0232922">3.0.6. <code>/usr/share/defaults/etc/zshrc</code></a></li>
<li><a href="#org29dd4bd">3.0.7. <code>/usr/share/defaults/etc/zlogin</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org72e6409">4. Goal</a></li>
<li><a href="#org814e0ab">5. List of Changes in <code>clearlinux-pkgs</code></a>
<ul>
<li><a href="#org1d4c113">5.1. gdm</a>
<ul>
<li><a href="#org42e489e">5.1.1. <code>Xsession</code></a></li>
</ul>
</li>
<li><a href="#org08769ef">5.2. lightdm</a>
<ul>
<li><a href="#org03b2e16">5.2.1. <code>lightdm-session</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5eb4c91">6. Limitations</a></li>
<li><a href="#org8e14cdb">7. References</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf0de18b" class="outline-2">
<h2 id="orgf0de18b"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
Currently, the shell default shell startup files for <code>sh</code> (Bourne shell, aliased to <code>bash</code> and thus would be omitted in the following discussion), <code>bash</code> (Bash), and <code>zsh</code> (Z Shell) are rather messy in the sense that:
</p>

<ul class="org-ul">
<li>The environment variables are different for <code>bash</code> and <code>zsh</code>.</li>
<li>Some functionalities are not available for <code>zsh</code> while it's feasible to achieve them in <code>zsh</code>.</li>
<li>Startup files are sourcing each other, and in some cases the same startup files would be sourced for multiple times.</li>
<li><code>zsh</code> has an entirely different set of startup files as oppose to <code>sh</code> and <code>bash</code>, but actually most statement in the startup files are compatible to all of the three shells. This may result in inconsistency when future a future update changed startup files for one <code>bash</code>, while such change is not incorporated into <code>zsh</code>, or vice versa.</li>
<li>The default global startup files are stored in <code>/usr/share/defaults/etc/</code>, and an average user may not be aware of them, as many distributions have the system-wide default startup files stored in <code>/etc</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgcdf9631" class="outline-2">
<h2 id="orgcdf9631"><span class="section-number-2">2</span> Loading process of startup files</h2>
<div class="outline-text-2" id="text-2">
<p>
A summary of how the startup files are processed on Clear Linux (Version 29480) is given below:
</p>
</div>

<div id="outline-container-org66ccf21" class="outline-3">
<h3 id="org66ccf21"><span class="section-number-3">2.1</span> Login shell:</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Depending on whether the Linux OS boots into text mode or graphical mode, the concept of login shell would be different.
</p>
</div>

<div id="outline-container-org1a71cac" class="outline-4">
<h4 id="org1a71cac"><span class="section-number-4">2.1.1</span> Text Mode</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
If the user is first presented with a login prompt, and after he successfully log in to a user account the shell prompt appears, then it's <b>text mode</b>.
</p>

<p>
The shell he is presented to is the <b>login shell</b>, which could be changed via <code>chsh</code> or <code>lchsh</code>. And any sub-process of login shell would inherit the environment variables of the login shell. In particular, if the user invoked another shell either by directly executing a shell program, by using commands such as <code>su</code>, <code>sudo</code>, or by executing a shell script, the invoked shell would inherit the environment variables of the login shell. Thus correctly setting environment variables for the login shell would ensure that they would also be set for any shell invoked after login, while the user is still able to override those environment variables directly or startup files of (interactive) shells.
</p>
</div>

<ol class="org-ol">
<li><a id="org129098e"></a><code>bash</code><br />
<div class="outline-text-5" id="text-2-1-1-1">
<p>
The <code>bash</code> login shell first looks for the global profile at <code>/usr/share/defaults/etc/profile</code>. Next it tries to locate a per-user profile at <code>~/.bash_profile</code>, <code>~/.bash_login</code>, and <code>~/.profile</code>, where the first one found, in that order, is sourced. By default, only <code>~/.profile</code> exists.
</p>

<p>
In addition, when a <code>bash</code> login shell exits, it will source per-user logout script at <code>~/.bash_logout</code>, which is not created by default.
</p>
</div>
</li>

<li><a id="orge5bfcf6"></a><code>zsh</code><br />
<div class="outline-text-5" id="text-2-1-1-2">
<p>
A <code>zsh</code> login shell will source three types of startup files, i.e. <code>zshenv</code>, <code>zprofile</code>, and <code>zlogin</code>, in that order. For each of the five types, <code>zsh</code> would look for a global configuration in <code>/usr/share/defaults/etc/&lt;TYPE&gt;</code>, and then the user's configuration in <code>~/.&lt;TYPE&gt;</code>.
</p>

<p>
Similar to <code>bash</code>, when a <code>zsh</code> process exits, it will source a logout script, <code>~/.zlogout</code>.
</p>

<p>
Currently, the default global <code>env</code>, <code>zshrc</code>, and <code>zlogin</code> are created, but no local startup file is created.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgd05ac9f" class="outline-4">
<h4 id="orgd05ac9f"><span class="section-number-4">2.1.2</span> Graphical Mode</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
If the user has a graphical display manager, such as <code>gdm</code>, installed and enabled, the user would be presented with a graphical user interface where he can choose an desktop environment for the session, and finish the authentication process to log in to a user account. This is called <code>Graphical Mode</code>.
</p>

<p>
Unlike the text mode, neither <code>bash</code> nor <code>zsh</code> is the actual login shell. So the loading sequence of startup files described above might not be valid. Take <code>gdm</code> as an example, it is <code>/usr/libexec/gdm-x-session</code> that acts as a login shell, in the sense that every process started after login is a sub-process of it. What startup files the graphical session will source is complicated, and it varies by both the choice of display manager, and the distribution.
</p>
</div>

<ol class="org-ol">
<li><a id="org89fd89a"></a><code>gdm</code><br />
<div class="outline-text-5" id="text-2-1-2-1">
<p>
In the case of <code>gdm</code>, <code>/usr/share/gdm/Xsession</code> defines that <code>gdm-x-session</code> should source the followings files:
</p>
<ul class="org-ul">
<li><code>/etc/profile</code>, which is system-wide profile in many <i>other distribution</i>, but a <i>admin override profile</i> in Clear Linux.</li>
<li><code>/usr/share/defaults/etc/profile</code>, the default system-wide profile in Clear Linux (A patch has been submitted which suggest to source this file first)</li>
<li><code>~/.profile</code>, the per-user profile</li>
<li><code>/etc/xprofile</code>, system-wide X specific setups</li>
<li><p>
<code>~/.xprofile</code>, per-user X specific setups
</p>

<p>
By default, only <code>/usr/share/defaults/etc/profile</code> and <code>~/.profile</code> exits, therefore the the startup process is the same as the default bahaviour of a <code>bash</code> login shell.
</p></li>
</ul>
</div>
</li>

<li><a id="org90203ea"></a><code>lightdm</code><br />
<div class="outline-text-5" id="text-2-1-2-2">
<p>
<code>/usr/share/lightdm/lightdm-session</code> (?) defines the same sequence of startup files, except that it doesn't include <code>/usr/share/defaults/etc/profile</code>. (I've sent a patch to the dev team already.)
</p>
</div>
</li>

<li><a id="orgb91c6ea"></a><code>sddm</code><br />
<div class="outline-text-5" id="text-2-1-2-3">
<p>
<code>/usr/share/sddm/Xsession</code> (?) and <code>/usr/share/sddm/wayland-session</code> (?) reads startup files according to the <code>$SHELL</code> environment variable. For <code>bash</code>, <code>fish</code>, and all other shell programs except <code>zsh</code>, it reads the same sequence of files as <code>gdm</code>. For <code>zsh</code>, it
</p>
</div>
</li>
</ol>
</div>
</div>
