TidyShell/README.org
*** Interactive Shell
    When a user starts a terminal emulator, the shell launched in the terminal is a interactive shell. Also, the login shell in the text mode is interactive as well.

**** ~bash~
     ~bash~ interactive shell first source the global ~bash~ configuration at =/usr/share/defaults/etc/bash.bashrc= and then the user configuration at =~/.bashrc=. Both files exits after installation of ~bash~.

     If it's also a login shell, then these two configurations would be sourced at last.

**** ~zsh~
     ~zsh~ interactive shell will source =zshenv= and =zshrc= files at =/usr/share/defaults/etc/<TYPE>= and =~/.<TYPE>= respectively. Only the system-wide =env= and =zshrc= exists after installing of ~zsh~.

     If it's also a login shell, then =zshrc= files are sourced after =zprofile=, and before =zlogin=, if any of them exists.

*** Non-interactive Shell
    When a shell program is called upon by another process to read and execute a shell script, then the shell program is in non-interactive mode.

**** ~bash~
     A non-interactive ~bash~ shell won't source =bashrc= files, and in fact unless it is invoked by ~bash --login~, it won't source any startup files.

     If =--login= option is specified, then =bashrc= files won't be sourced, but all other ~bash~ startup files mentioned above will be sourced.

**** ~zsh~
     Similar to ~bash~, a non-interactive ~zsh~ shell won't source =zshrc= regardless of whether it's login shell or not.

     If it's login shell, i.e if it's invoked with =--login= option, then it also sources =zprofile= and =zlogin= during startup.

     But there's one thing worth to mention, any ~zsh~ instance sources =zshenv= files. Thus even for a non-login, non-interactive ~zsh~ shell, =zshenv= files are still sourced.

** Current default startup files

**** =/usr/share/defaults/etc/profile=
     This file sets various environment variables, determines the appearance of the prompt, and sources the shell scripts under =/usr/share/defaults/etc/profile.d/=, which are created by default. And the system admin could make overrides by creating =/etc/profile=, and putting scripts under =/etc/profile.d/=, which would be sourced by =/usr/share/defaults/etc/profile=.

     This file is sourced by
- ~bash~ login shell for twice, where the second time is via =~/.profile=
- ~bash~ non-login shell for twice, via =/usr/share/defaults/etc/bash.bashrc= and =~/.bashrc= respectively.
- =/usr/share/gdm/Xsession= for twice if a graphical display manager is launched, where the second time is via =~/.profile=

***** =/usr/share/defaults/etc/profile.d/*=
      There are 7 files in this directory and they're sourced by =/usr/share/defaults/etc/profile=.
- =10-command-not-found.sh=, provides similar functionality as =command-not-found= in =Ubuntu=.
- =50-swupd.bash=, provides auto-completion of =swupd= for ~bash~.
- =bash_completion.sh= provides auto-completion for ~bash~.
  - The simple script below shows the number of command completion that is unique for ~zsh~, unique for ~bash~, and common for both shells, respectively. Currently, there numbers are 764, 455, and 149. Though ~zsh~ ships with more auto-completions than ~bash~ has, but sourcing the ~bash~ completions does extend ~zsh~‘s functionality.
    #+BEGIN_SRC shell :exports both
      #!/usr/bin/zsh
      zsh="$(find /usr/share/zsh -path '*/functions/_*' |
           sort |
           sed -e 's/.*functions\/_//')"
      bash="$(find /usr/share/bash-completion/completions/ -not -type l -not -name '_*' |
            sed -e 's/.*completions\///g' |
            sort)"
      comm -23 <(echo $zsh) <(echo $bash) | wc -l
      comm -13 <(echo $zsh) <(echo $bash) | wc -l
      comm -12 <(echo $zsh) <(echo $bash) | wc -l
    #+END_SRC
- =50-colors.sh= colourise the output of =ls= command, and also set the colours for GCC compilation flags.
- =50-prompt= colourise the prompt defined in  =/usr/share/defaults/etc/profile=.
- =ccache.sh= add =/usr/lib64/ccache/bin= to accelerate GCC compilation.
- =flatpak.sh= sets up directories so that apps installed via =flatpak= would correctly show up in =gnome=.

**** =~/.profile=
     It sources =~/.bashrc=, which sources =/usr/share/defaults/etc/profile=. Thus its redundant.

     This file is sourced by
- ~bash~ login shell (when neither =~/.bash_profile= nor =~/.bash_login= is available, which is the default)
- =/usr/share/gdm/Xsession= in graphical mode

**** =/usr/share/defaults/etc/bash.bashrc=
     It sources the global profile =/usr/share/defaults/etc/profile=. It also allow admin overrides by sourcing =/etc/profile=, which is redundant since =/usr/share/defaults/etc/profile= already did that.

     It's sourced by
- ~bash~ non-login shell for twice, where the second time is via =~/.bashrc=

**** =~/.bashrc=
     Has identical contents as =/usr/share/defaults/etc/bash.bashrc= has, which makes it redundant.

     It's sourced by
- ~bash~ non-login shell

