TidyShell/README.html

<div id="outline-container-orgcabf737" class="outline-3">
<h3 id="orgcabf737"><span class="section-number-3">2.2</span> Interactive Shell</h3>
<div class="outline-text-3" id="text-2-2">
<p>
When a user starts a terminal emulator, the shell launched in the terminal is a interactive shell. Also, the login shell in the text mode is interactive as well.
</p>
</div>

<div id="outline-container-orgc12183b" class="outline-4">
<h4 id="orgc12183b"><span class="section-number-4">2.2.1</span> <code>bash</code></h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
<code>bash</code> interactive shell first source the global <code>bash</code> configuration at <code>/usr/share/defaults/etc/bash.bashrc</code> and then the user configuration at <code>~/.bashrc</code>. Both files exits after installation of <code>bash</code>.
</p>

<p>
If it's also a login shell, then these two configurations would be sourced at last.
</p>
</div>
</div>

<div id="outline-container-orgc229850" class="outline-4">
<h4 id="orgc229850"><span class="section-number-4">2.2.2</span> <code>zsh</code></h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
<code>zsh</code> interactive shell will source <code>zshenv</code> and <code>zshrc</code> files at <code>/usr/share/defaults/etc/&lt;TYPE&gt;</code> and <code>~/.&lt;TYPE&gt;</code> respectively. Only the system-wide <code>env</code> and <code>zshrc</code> exists after installing of <code>zsh</code>.
</p>

<p>
If it's also a login shell, then <code>zshrc</code> files are sourced after <code>zprofile</code>, and before <code>zlogin</code>, if any of them exists.
</p>
</div>
</div>
</div>

<div id="outline-container-org33eb6b3" class="outline-3">
<h3 id="org33eb6b3"><span class="section-number-3">2.3</span> Non-interactive Shell</h3>
<div class="outline-text-3" id="text-2-3">
<p>
When a shell program is called upon by another process to read and execute a shell script, then the shell program is in non-interactive mode.
</p>
</div>

<div id="outline-container-orgf560267" class="outline-4">
<h4 id="orgf560267"><span class="section-number-4">2.3.1</span> <code>bash</code></h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
A non-interactive <code>bash</code> shell won't source <code>bashrc</code> files, and in fact unless it is invoked by <code>bash --login</code>, it won't source any startup files.
</p>

<p>
If <code>--login</code> option is specified, then <code>bashrc</code> files won't be sourced, but all other <code>bash</code> startup files mentioned above will be sourced.
</p>
</div>
</div>

<div id="outline-container-org6d854d2" class="outline-4">
<h4 id="org6d854d2"><span class="section-number-4">2.3.2</span> <code>zsh</code></h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Similar to <code>bash</code>, a non-interactive <code>zsh</code> shell won't source <code>zshrc</code> regardless of whether it's login shell or not.
</p>

<p>
If it's login shell, i.e if it's invoked with <code>--login</code> option, then it also sources <code>zprofile</code> and <code>zlogin</code> during startup.
</p>

<p>
But there's one thing worth to mention, any <code>zsh</code> instance sources <code>zshenv</code> files. Thus even for a non-login, non-interactive <code>zsh</code> shell, <code>zshenv</code> files are still sourced.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orge05ed78" class="outline-2">
<h2 id="orge05ed78"><span class="section-number-2">3</span> Current default startup files</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgccb0ffa" class="outline-4">
<h4 id="orgccb0ffa"><span class="section-number-4">3.0.1</span> <code>/usr/share/defaults/etc/profile</code></h4>
<div class="outline-text-4" id="text-3-0-1">
<p>
This file sets various environment variables, determines the appearance of the prompt, and sources the shell scripts under <code>/usr/share/defaults/etc/profile.d/</code>, which are created by default. And the system admin could make overrides by creating <code>/etc/profile</code>, and putting scripts under <code>/etc/profile.d/</code>, which would be sourced by <code>/usr/share/defaults/etc/profile</code>.
</p>

<p>
This file is sourced by
</p>
<ul class="org-ul">
<li><code>bash</code> login shell for twice, where the second time is via <code>~/.profile</code></li>
<li><code>bash</code> non-login shell for twice, via <code>/usr/share/defaults/etc/bash.bashrc</code> and <code>~/.bashrc</code> respectively.</li>
<li><code>/usr/share/gdm/Xsession</code> for twice if a graphical display manager is launched, where the second time is via <code>~/.profile</code></li>
</ul>
</div>

<ol class="org-ol">
<li><a id="orgd85ca76"></a><code>/usr/share/defaults/etc/profile.d/*</code><br />
<div class="outline-text-5" id="text-3-0-1-1">
<p>
There are 7 files in this directory and they're sourced by <code>/usr/share/defaults/etc/profile</code>.
</p>
<ul class="org-ul">
<li><code>10-command-not-found.sh</code>, provides similar functionality as <code>command-not-found</code> in <code>Ubuntu</code>.</li>
<li><code>50-swupd.bash</code>, provides auto-completion of <code>swupd</code> for <code>bash</code>.</li>
<li><code>bash_completion.sh</code> provides auto-completion for <code>bash</code>.
<ul class="org-ul">
<li><p>
The simple script below shows the number of command completion that is unique for <code>zsh</code>, unique for <code>bash</code>, and common for both shells, respectively. Currently, there numbers are 764, 455, and 149. Though <code>zsh</code> ships with more auto-completions than <code>bash</code> has, but sourcing the <code>bash</code> completions does extend ~zsh~‘s functionality.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!/usr/bin/</span><span style="color: #4f97d7; font-weight: bold;">zsh</span>
<span style="color: #7590db;">zsh</span>=<span style="color: #2d9574;">"$(find /usr/share/zsh -path '*/functions/_*' |</span>
<span style="color: #2d9574;">     sort |</span>
<span style="color: #2d9574;">     sed -e 's/.*functions\/_//')"</span>
<span style="color: #7590db;">bash</span>=<span style="color: #2d9574;">"$(find /usr/share/bash-completion/completions/ -not -type l -not -name '_*' |</span>
<span style="color: #2d9574;">      sed -e 's/.*completions\///g' |</span>
<span style="color: #2d9574;">      sort)"</span>
comm -23 &lt;<span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">echo</span> $<span style="color: #7590db;">zsh</span><span style="color: #4f97d7;">)</span> &lt;<span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">echo</span> $<span style="color: #7590db;">bash</span><span style="color: #4f97d7;">)</span> | wc -l
comm -13 &lt;<span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">echo</span> $<span style="color: #7590db;">zsh</span><span style="color: #4f97d7;">)</span> &lt;<span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">echo</span> $<span style="color: #7590db;">bash</span><span style="color: #4f97d7;">)</span> | wc -l
comm -12 &lt;<span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">echo</span> $<span style="color: #7590db;">zsh</span><span style="color: #4f97d7;">)</span> &lt;<span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">echo</span> $<span style="color: #7590db;">bash</span><span style="color: #4f97d7;">)</span> | wc -l
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">764</td>
</tr>

<tr>
<td class="org-right">455</td>
</tr>

<tr>
<td class="org-right">149</td>
</tr>
</tbody>
</table></li>
</ul></li>

<li><code>50-colors.sh</code> colourise the output of <code>ls</code> command, and also set the colours for GCC compilation flags.</li>
<li><code>50-prompt</code> colourise the prompt defined in  <code>/usr/share/defaults/etc/profile</code>.</li>
<li><code>ccache.sh</code> add <code>/usr/lib64/ccache/bin</code> to accelerate GCC compilation.</li>
<li><code>flatpak.sh</code> sets up directories so that apps installed via <code>flatpak</code> would correctly show up in <code>gnome</code>.</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org175894b" class="outline-4">
<h4 id="org175894b"><span class="section-number-4">3.0.2</span> <code>~/.profile</code></h4>
<div class="outline-text-4" id="text-3-0-2">
<p>
It sources <code>~/.bashrc</code>, which sources <code>/usr/share/defaults/etc/profile</code>. Thus its redundant.
</p>

<p>
This file is sourced by
</p>
<ul class="org-ul">
<li><code>bash</code> login shell (when neither <code>~/.bash_profile</code> nor <code>~/.bash_login</code> is available, which is the default)</li>
<li><code>/usr/share/gdm/Xsession</code> in graphical mode</li>
</ul>
</div>
</div>

<div id="outline-container-org7e5713f" class="outline-4">
<h4 id="org7e5713f"><span class="section-number-4">3.0.3</span> <code>/usr/share/defaults/etc/bash.bashrc</code></h4>
<div class="outline-text-4" id="text-3-0-3">
<p>
It sources the global profile <code>/usr/share/defaults/etc/profile</code>. It also allow admin overrides by sourcing <code>/etc/profile</code>, which is redundant since <code>/usr/share/defaults/etc/profile</code> already did that.
</p>

<p>
It's sourced by
</p>
<ul class="org-ul">
<li><code>bash</code> non-login shell for twice, where the second time is via <code>~/.bashrc</code></li>
</ul>
</div>
</div>

<div id="outline-container-org484cef5" class="outline-4">
<h4 id="org484cef5"><span class="section-number-4">3.0.4</span> <code>~/.bashrc</code></h4>
<div class="outline-text-4" id="text-3-0-4">
<p>
Has identical contents as <code>/usr/share/defaults/etc/bash.bashrc</code> has, which makes it redundant.
</p>

<p>
It's sourced by
</p>
<ul class="org-ul">
<li><code>bash</code> non-login shell</li>
</ul>
</div>
</div>
