TidyShell/README.org
**** =/usr/share/defaults/etc/zshenv=
     It sets environment variables whose majority is identical to those set by =/usr/share/defaults/etc/profile=. It also allows admin overrides by sourcing =/etc/zshenv=

     But notice that, various GCC flags and the =PATH= are not exactly the same, in =Version 29480=.

     It's sourced by
- ~zsh~ login shell
- ~zsh~ non-login shell

**** =/usr/share/defaults/etc/zshrc=
     It sets aliases, keybindings, and the prompt for ~zsh~ shell.

     It's sourced by
- ~zsh~ login shell
- ~zsh~ non-login shell

**** =/usr/share/defaults/etc/zlogin=
     It does not do anything except sourcing =/etc/zlogin= to allow admin overrides.

     It's sourced by
- ~zsh~ login shell
- ~zsh~ non-login shell

** Goal
   In summary, this project aims to achieve the following:

1. System-wide defaults shall be defined in =/usr/share/defaults/etc/profile= only.
   - First, it's responsible for setting up environment variables for login shell and =xsession=, and therefore all of their sub-processes will inherit those environment variables.
     - By default, this file is sourced by ~bash~ login shell, and =gdm='s =xsession=.
     - ~bash~ and =gdm= would also source =~/.profile=, but we shall not source =/usr/share/defaults/etc/profile= in it.
     - ~zsh~'s login shell would source =zshenv=, =zprofile=, =zshrc=, =zlogin=.
       - =zshenv= shall be avoided because it's sourced for all ~zsh~ instances.
       - =zlogin= is sourced after =zshrc=, where people tends to make customization. To ensure compatibility, we'd not use =zlogin=, but =zprofile= instead, which is sourced before =zshrc=
       - =zprofile= shall source =/usr/share/defaults/etc/profile=, and  this is how we ensure the consistency.
       - To sum up, we only needs to source =/usr/share/defaults/etc/profile= in =/usr/share/defaults/etc/zprofile=
   - Second, it provides additional features to interactive shells:
     - Depending on the shell, the implementation of various functionalities would be slightly different. To determine the type of shell, we can use the following code block.
       #+BEGIN_SRC shell :exports both
         #!/usr/bin/sh
         case "$(ps -o args= $$ | sed -e 's# .*##' -e 's#.*/##')" in
           sh) echo 'sh';;
           bash) echo 'bash';;
           zsh) echo 'zsh';;
           *) echo 'UNKNOWN';;
         esac
       #+END_SRC
     - The following test could determine whether a shell is interactive, which works for ~sh~, ~bash~, and ~zsh~. For example, when running the following code block as an shell script, it must be non-interactive. But if the /shebang/ specified the =-i= option to ~bash~, it forces the shell script to be executed by a interactive shell.
       #+BEGIN_SRC shell :exports both
         #!/usr/bin/bash
         [ -n "$(echo $- | grep i)" ] && echo 'interactive' || echo 'non-interactive'
       #+END_SRC
       #+BEGIN_SRC shell :exports both
         #!/usr/bin/bash -i
         [ -n "$(echo $- | grep i)" ] && echo 'interactive' || echo 'non-interactive'
       #+END_SRC
     - This is more reliable than checking the existence of environment variables such as =$BASH_VERSION= and =$ZSH_VERSION=. Consider the case where the parent process is a ~zsh~ shell, and the user launched a ~bash~ shell in ~zsh~, then both =$BASH_VERSION= and =$ZSH_VERSION= are available. Nevertheless, these version variables are helpful as some features maybe version-specific.
     - In particular, it's very easy to use the existing ~bash~ completions in ~zsh~ by executing the following first
       #+BEGIN_SRC shell
         #!/usr/bin/zsh
         autoload -U +X compinit && compinit
         autoload -U +X bashcompinit && bashcompinit
       #+END_SRC
2. Per-user defaults shall be left empty, but with information regarding the location of system-wide defaults in =/usr/share/defaults/etc/=, and the =/etc/= directory where system admins could override the system-wide defaults.

** List of =clearlinux-pkgs= Involved
*** [[https://github.com/clearlinux-pkgs/lightdm][lightdm]]
**** [[https://github.com/clearlinux-pkgs/lightdm/blob/master/0004-Add-lightdm-session.patch][0004-Add-lightdm-session.patch]]
     1. The sequence of profiles to be sourced shall be the consistent as =gdm=, which is =/etc/profile=, =/usr/share/defaults/etc/profile=, =$HOME/.profile=, =/etc/xprofile=, =$HOME/.xprofile=. Currently, the second one is missing.

** Limitations
- Only =bash/sh= and ~zsh~ are taken into account, while =fish= is not, which is also defined in =/usr/share/defauls/etc/shells=.
- As for (graphical) display manager, currently =gdm=, =lightdm=, and =sddm= are available on Clear Linux. But only =gdm= has been tested.
