TidyShell/README.html

<div id="outline-container-orgf1772ad" class="outline-4">
<h4 id="orgf1772ad"><span class="section-number-4">3.0.5</span> <code>/usr/share/defaults/etc/zshenv</code></h4>
<div class="outline-text-4" id="text-3-0-5">
<p>
It sets environment variables whose majority is identical to those set by <code>/usr/share/defaults/etc/profile</code>. It also allows admin overrides by sourcing <code>/etc/zshenv</code>
</p>

<p>
But notice that, various GCC flags and the <code>PATH</code> are not exactly the same, in <code>Version 29480</code>.
</p>

<p>
It's sourced by
</p>
<ul class="org-ul">
<li><code>zsh</code> login shell</li>
<li><code>zsh</code> non-login shell</li>
</ul>
</div>
</div>

<div id="outline-container-org0232922" class="outline-4">
<h4 id="org0232922"><span class="section-number-4">3.0.6</span> <code>/usr/share/defaults/etc/zshrc</code></h4>
<div class="outline-text-4" id="text-3-0-6">
<p>
It sets aliases, keybindings, and the prompt for <code>zsh</code> shell.
</p>

<p>
It's sourced by
</p>
<ul class="org-ul">
<li><code>zsh</code> login shell</li>
<li><code>zsh</code> non-login shell</li>
</ul>
</div>
</div>

<div id="outline-container-org29dd4bd" class="outline-4">
<h4 id="org29dd4bd"><span class="section-number-4">3.0.7</span> <code>/usr/share/defaults/etc/zlogin</code></h4>
<div class="outline-text-4" id="text-3-0-7">
<p>
It does not do anything except sourcing <code>/etc/zlogin</code> to allow admin overrides.
</p>

<p>
It's sourced by
</p>
<ul class="org-ul">
<li><code>zsh</code> login shell</li>
<li><code>zsh</code> non-login shell</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org72e6409" class="outline-2">
<h2 id="org72e6409"><span class="section-number-2">4</span> Goal</h2>
<div class="outline-text-2" id="text-4">
<p>
In summary, this project aims to achieve the following:
</p>

<ol class="org-ol">
<li>System-wide defaults shall be defined in <code>/usr/share/defaults/etc/profile</code> only.
<ul class="org-ul">
<li>First, it's responsible for setting up environment variables for login shell and <code>xsession</code>, and therefore all of their sub-processes will inherit those environment variables.
<ul class="org-ul">
<li>By default, this file is sourced by <code>bash</code> login shell, and <code>gdm</code>'s <code>xsession</code>.</li>
<li><code>bash</code> and <code>gdm</code> would also source <code>~/.profile</code>, but we shall not source <code>/usr/share/defaults/etc/profile</code> in it.</li>
<li><code>zsh</code>'s login shell would source <code>zshenv</code>, <code>zprofile</code>, <code>zshrc</code>, <code>zlogin</code>.
<ul class="org-ul">
<li><code>zshenv</code> shall be avoided because it's sourced for all <code>zsh</code> instances.</li>
<li><code>zlogin</code> is sourced after <code>zshrc</code>, where people tends to make customization. To ensure compatibility, we'd not use <code>zlogin</code>, but <code>zprofile</code> instead, which is sourced before <code>zshrc</code></li>
<li><code>zprofile</code> shall source <code>/usr/share/defaults/etc/profile</code>, and  this is how we ensure the consistency.</li>
<li>To sum up, we only needs to source <code>/usr/share/defaults/etc/profile</code> in <code>/usr/share/defaults/etc/zprofile</code></li>
</ul></li>
</ul></li>
<li>Second, it provides additional features to interactive shells:
<ul class="org-ul">
<li><p>
Depending on the shell, the implementation of various functionalities would be slightly different. To determine the type of shell, we can use the following code block.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!/usr/bin/</span><span style="color: #4f97d7; font-weight: bold;">sh</span>
<span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #2d9574;">"$(ps -o args= $$ | sed -e 's# .*##' -e 's#.*/##')"</span><span style="color: #4f97d7; font-weight: bold;"> in</span>
  sh) <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">'sh'</span>;;
  bash) <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">'bash'</span>;;
  zsh) <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">'zsh'</span>;;
  *) <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">'UNKNOWN'</span>;;
<span style="color: #4f97d7; font-weight: bold;">esac</span>
</pre>
</div>

<pre class="example">
zsh
</pre></li>

<li><p>
The following test could determine whether a shell is interactive, which works for <code>sh</code>, <code>bash</code>, and <code>zsh</code>. For example, when running the following code block as an shell script, it must be non-interactive. But if the <i>shebang</i> specified the <code>-i</code> option to <code>bash</code>, it forces the shell script to be executed by a interactive shell.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!/usr/bin/</span><span style="color: #4f97d7; font-weight: bold;">bash</span>
<span style="color: #4f97d7;">[</span> -n <span style="color: #2d9574;">"$(echo $- | grep i)"</span> <span style="color: #4f97d7;">]</span> &amp;&amp; <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">'interactive'</span> || <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">'non-interactive'</span>
</pre>
</div>

<pre class="example">
non-interactive
</pre>


<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!/usr/bin/</span><span style="color: #4f97d7; font-weight: bold;">bash</span><span style="color: #2aa1ae; background-color: #292e34;"> -i</span>
<span style="color: #4f97d7;">[</span> -n <span style="color: #2d9574;">"$(echo $- | grep i)"</span> <span style="color: #4f97d7;">]</span> &amp;&amp; <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">'interactive'</span> || <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">'non-interactive'</span>
</pre>
</div>

<pre class="example">
non-interactive
</pre></li>

<li>This is more reliable than checking the existence of environment variables such as <code>$BASH_VERSION</code> and <code>$ZSH_VERSION</code>. Consider the case where the parent process is a <code>zsh</code> shell, and the user launched a <code>bash</code> shell in <code>zsh</code>, then both <code>$BASH_VERSION</code> and <code>$ZSH_VERSION</code> are available. Nevertheless, these version variables are helpful as some features maybe version-specific.</li>
<li><p>
In particular, it's very easy to use the existing <code>bash</code> completions in <code>zsh</code> by executing the following first
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!/usr/bin/</span><span style="color: #4f97d7; font-weight: bold;">zsh</span>
<span style="color: #4f97d7;">autoload</span> -U +X compinit &amp;&amp; compinit
<span style="color: #4f97d7;">autoload</span> -U +X bashcompinit &amp;&amp; bashcompinit
</pre>
</div></li>
</ul></li>
</ul></li>
<li>Per-user defaults shall be left empty, but with information regarding the location of system-wide defaults in <code>/usr/share/defaults/etc/</code>, and the <code>/etc/</code> directory where system admins could override the system-wide defaults.</li>
</ol>
</div>
</div>

<div id="outline-container-org814e0ab" class="outline-2">
<h2 id="org814e0ab"><span class="section-number-2">5</span> List of Changes in <code>clearlinux-pkgs</code></h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org1d4c113" class="outline-3">
<h3 id="org1d4c113"><span class="section-number-3">5.1</span> <a href="https://github.com/clearlinux-pkgs/gdm">gdm</a></h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org42e489e" class="outline-4">
<h4 id="org42e489e"><span class="section-number-4">5.1.1</span> <code>Xsession</code></h4>
<div class="outline-text-4" id="text-5-1-1">
<ol class="org-ol">
<li><code>/usr/share/defaults/etc/profile</code> shall be sourced before <code>/etc/profile</code>.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org08769ef" class="outline-3">
<h3 id="org08769ef"><span class="section-number-3">5.2</span> <a href="https://github.com/clearlinux-pkgs/lightdm">lightdm</a></h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-org03b2e16" class="outline-4">
<h4 id="org03b2e16"><span class="section-number-4">5.2.1</span> <code>lightdm-session</code></h4>
<div class="outline-text-4" id="text-5-2-1">
<ol class="org-ol">
<li>The sequence of profiles to be sourced shall be the consistent as <code>gdm</code>, which is <code>/etc/profile</code>, <code>/usr/share/defaults/etc/profile</code>, <code>$HOME/.profile</code>, <code>/etc/xprofile</code>, <code>$HOME/.xprofile</code>. Currently, the second one is missing.</li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-org5eb4c91" class="outline-2">
<h2 id="org5eb4c91"><span class="section-number-2">6</span> Limitations</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Only <code>bash/sh</code> and <code>zsh</code> are taken into account, while <code>fish</code> is not, which is also defined in <code>/usr/share/defauls/etc/shells</code>.</li>
<li>As for (graphical) display manager, currently <code>gdm</code>, <code>lightdm</code>, and <code>sddm</code> are available on Clear Linux. But only <code>gdm</code> has been tested.</li>
</ul>
</div>
</div>
